app/Http/Controllers/Venta_Detalle/Venta_Detalle.php

    public function store(Request $request)
    {
        $validator = Validator::make($request->all(),Ventas_DetallesModel::rules());
        if ($validator->fails()) {
            return redirect(route('venta_detalle.show',$request->get('venta_id')))->withErrors($validator);
---
select * from `venta_detalle` where `venta_id` = '78'

    public function show($id)
    {
        $venta = VentasModel::findOrFail($id);
        $venta_detalle = Ventas_DetallesModel::where('venta_id',$id)->get();

        foreach ($venta_detalle as $item) {
            $item->precioTotal = $item->cantidad * $item->productos->precio_venta;
        }

        $venta->productosTotal = $venta_detalle->sum('cantidad');
        $venta->precioTotal = $venta_detalle->sum('precioTotal');
---
select * from `ventas` where `ventas`.`id` = '75' limit 1
select * from `productos` where `productos`.`id` = '1' and `productos`.`id` is not null limit 1

    public function update(Request $request, $id)
    {
        $venta = VentasModel::findOrFail($id);
        $venta_d = Ventas_DetallesModel::findOrFail($request->get('venta_detalle_id'));
        $venta_d->cantidad = $request->get('cantidad');
        $venta_d->save();
---
select * from `ventas` where `ventas`.`id` = '75' limit 1
update `venta_detalle` set `cantidad` = '10', `updated_at` = '2017-09-20 14:26:26' where `id` = '186'

    public function destroy($id)
    {
        $venta_detalle = Ventas_DetallesModel::findOrFail($id);
        $venta_detalle->delete();
---
delete from `venta_detalle` where `id` = '170'