app/Http/Controllers/Venta_Detalle/Venta_Detalle.php

select * from `venta_detalle` where `venta_id` = '75'
select * from `ventas` where `ventas`.`id` = '78' limit 1
---
    public function store(Request $request)
    {

        $validator = Validator::make($request->all(),Ventas_DetallesModel::rules());
        if ($validator->fails()) {
            return redirect(route('venta_detalle.show',$request->get('venta_id')))->withErrors($validator);
        }
        $inventario = new Inventario();
        $newventa = Ventas_DetallesModel::where('producto_id', $request->get('producto_id'))
            ->where('venta_id', $request->get('venta_id'))
            ->first();

        $controlStock = $inventario->descontarProducto($request->producto_id,$request->cantidad);
        if($controlStock != true)
        {
            if($newventa != null)
            {
                $newventa->cantidad += $request->get('cantidad');
                $newventa->save();
            }
            else
            {
                $newventa = new Ventas_DetallesModel();
                $newventa->venta_id = $request->get('venta_id');

select * from `ventas` where `ventas`.`id` = '78' limit 1
---
    public function show($id)
    {
        $venta = VentasModel::findOrFail($id);

select * from `ventas` where `ventas`.`id` = '78' limit 1
---
    public function update(Request $request, $id)
    {

        $inventario = new Inventario();
        $venta = VentasModel::findOrFail($id);