app/Http/Controllers/Ventas/ListaProductos.php

    public function autocomplete()
    {
        $results = array();
        $barcode = null;

        $term = Input::get('term');

        if(is_numeric($term)) {
            $barcode = $term;
        }

        if($barcode) {
            $producto = ProductosModel:: where('barcode',$barcode)->get();
        } else {
            $producto = ProductosModel:: where('nombre', 'LIKE', '%' . $term . '%')->take(5)->get();
---
select * from `productos` where `nombre` LIKE '%leche%' limit 5