app/Http/Controllers/Ventas/Pendientes.php

select * from `ventas` where `estado` = 'Pendiente de entrega'
---
    public function index()
    {
        $ventasPendientes = VentasModel::where('estado','Pendiente de entrega')->get();