app/Http/Controllers/Ventas/Ventas.php

insert into `ventas` (`fecha_entrega`, `estado`, `user_id`, `cliente_id`, `updated_at`, `created_at`) values ('2017/09/18', 'Pendiente de entrega', '1', '4', '2017-09-19 17:47:12', '2017-09-19 17:47:12')
---
    public function store(Request $request)
    {
        if($request->get('cliente_id') == null)
        {
            dd("paso por aca");
            return redirect()->route('ventas.index')->with('message', 'Debe seleccionar un cliente!');;
        }
        else
            {
                $nuevaVenta = new VentasModel();
                $nuevaVenta->fecha_entrega = '2017/09/18';
                $nuevaVenta->estado = 'Pendiente de entrega';
                $nuevaVenta->user_id = Auth::id();
                $nuevaVenta->cliente_id = $request->get('cliente_id');
                $nuevaVenta->save();