app/Http/Controllers/Ventas/Ventas.php

    public function edit($id)
    {
        $venta = VentasModel::findOrFail($id);
---
select * from `ventas` where `ventas`.`id` = '89' limit 1

    public function update(Request $request, $id)
    {
        $ventas = VentasModel::findOrFail($id);
        $ventas->cliente_id = $request->get('cliente_id');
        $ventas->save();
---
select * from `ventas` where `ventas`.`id` = '89' limit 1
update `ventas` set `cliente_id` = '4', `updated_at` = '2017-09-20 14:25:56' where `id` = '89'

    public function destroy($id)
    {
        // Se obtiene todo el detalle de la facturacion
        $detalle = Ventas_DetallesModel::where('venta_id',$id)->get();

        if(count($detalle))
        {
            // Se devuelven todos los productos
            $inventario = new Inventario();
            $inventario->devolverProductosMultiples($detalle);
        }

        // Una vez devuelto el stock se eliminan los detalles
        Ventas_DetallesModel::where('venta_id',$id)->delete();

        // Se elimina la factura (que no fue finalizada)
        $ventas = VentasModel::findOrFail($id);
        $ventas->delete();
---
select * from `ventas` where `ventas`.`id` = '79' limit 1
delete from `ventas` where `id` = '79'